       *****************************************************************
       * DEV.............. : VICTOR GOMES
       * DATA .............: 30/09/2026
       * DESCRICAO.........: CADASTRO CLIENTES
       * NOME..............: PROG003
       *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG003.
       *****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       WORKING-STORAGE SECTION.

       *****************************************************************
       PROCEDURE DIVISION.
       *****************************************************************

